* Enunciado

Juan crea un fichero de nombre JFichero. María crea un enlace físico a JFichero y le da el nombre MFichero. Juan elimina JFichero. Luego Juan crea un nuevo fichero y también le llama JFichero. ¿Cuántos ficheros diferentes existen después de las acciones anteriores? ¿Sería diferente la respuesta si el enlace que ha creado María fuese un enlace simbólico de nombre MFichero que apuntara a JFichero?

* Solución

La cantidad de ficheros diferentes que existen después de estas acciones es 2 en el primer caso. Juan eliminó el fichero original "JFichero", y el enlace físico "MFichero" creado por María todavía apunta a los datos del fichero original. Además, Juan creó un nuevo fichero con el nombre "JFichero", lo que da como resultado dos ficheros diferentes con distinto nombre en el sistema de archivos.

Veamos un ejemplo de ejecución, aunque sea realizado por el mismo usuario

#+begin_src bash :results output :export both
  #!/bin/bash

  mkdir tmp; cd tmp
  touch JFichero # Creamos un archivo llamado JFichero
  ln JFichero MFichero # Creamos un enlace físico a JFichero y le damos el nombre MFichero
  rm JFichero # Eliminamos JFichero
  touch JFichero # Creamos un nuevo fichero también llamado JFichero
  # Imprimir los archivos y sus números de nodos-i, para ver si son diferentes:
  ls -li
  cd ..
  rm -rf tmp
#+end_src

#+RESULTS:
: total 0
: 27596584 -rw-rw-r-- 1 jlrisco jlrisco 0 sep 15 18:52 JFichero
: 27596579 -rw-rw-r-- 1 jlrisco jlrisco 0 sep 15 18:52 MFichero

Si el enlace que María creó fuera un enlace simbólico en lugar de un enlace físico, la respuesta es un archivo + un enlace simbólico. El enlace simbólico está temporalmente roto, pero al crear de nuevo "JFichero" vuelve a estar disponible. Veámoslo en el código de ejemplo:

#+begin_src bash :results output :export both
  #!/bin/bash

  mkdir tmp; cd tmp
  touch JFichero # Creamos un archivo llamado JFichero
  ln -s JFichero MFichero # Creamos un enlace simbólico a JFichero y le damos el nombre MFichero
  rm JFichero # Eliminamos JFichero
  touch JFichero # Creamos un nuevo fichero también llamado JFichero
  # Imprimir los archivos y sus números de nodos-i, para ver si son diferentes:
  ls -li
  cd ..
  rm -rf tmp
#+end_src

#+RESULTS:
: total 0
: 27596584 -rw-rw-r-- 1 jlrisco jlrisco 0 sep 15 19:01 JFichero
: 27596585 lrwxrwxrwx 1 jlrisco jlrisco 8 sep 15 18:57 MFichero -> JFichero
